{
  "books": [
    {
      "title": "You Don't Know JS: Up & Going First",
      "description": "It’s easy to learn parts of JavaScript, but much harder to learn it completely or even sufficiently whether you’re new to the language or have used it for years. You’ll get a more complete understanding of JavaScript. It’s easy to learn parts of JavaScript, but much harder to learn it completely or even sufficiently whether you’re new to the language or have used it for years. You’ll get a more complete understanding of JavaScript.",
      "category": "1",
      "subcategory": "20"
    },
    {
      "title": "You Don't Know JS: Scope and Closures",
      "description": "This is important in JavaScript language. Here's an explanation of scopes and closures to help you understand what they are. In JavaScript defines what variables you have access to. This is important in JavaScript language. Here's an explanation of scopes and closures to help you understand what they are. In JavaScript defines what variables you have access to.",
      "category": "1",
      "subcategory": "20"
    },
    {
      "title": "You Don't Know JS: This & Object Proto",
      "description": "No matter how much experience you have with JavaScript, odds are you don't fully understand the language. This concise, in depth guide takes you inside JavaScript's this structure and object prototypes. No matter how much experience you have with JavaScript, odds are you don't fully understand the language. This concise, in depth guide takes you inside JavaScript's this structure and object prototypes.",
      "category": "1",
      "subcategory": "20"
    },
    {
      "title": "You Don't Know JS: Types & Grammar",
      "description": "Get acquainted with JavaScript’s seven types: null, undefined, boolean, number, string, object, and symbol. Understand why JavaSript’s unique array, string, and number characteristics may delight or confound you. Get acquainted with JavaScript’s seven types: null, undefined, boolean, number, string, object, and symbol. Understand why JavaSript’s unique array, string, and number characteristics may delight or confound you.",
      "category": "1",
      "subcategory": "20"
    },
    {
      "title": "You Don't Know JS: Async & Performance",
      "description": "Like other books in this series, You Don’t Know JS: Async & Performance dives into trickier parts of the language that many JavaScript programmers simply avoid. Armed with this knowledge. Like other books in this series, You Don’t Know JS: Async & Performance dives into trickier parts of the language that many JavaScript programmers simply avoid. Armed with this knowledge.",
      "category": "1",
      "subcategory": "20"
    },
    {
      "title": "Lolita by Vladimir Nabokov",
      "description": "The book is internationally famous for its innovative style and infamous for its controversial subject: the protagonist and unreliable narrator, middle aged Humbert Humbert, becomes obsessed.",
      "category": "1",
      "subcategory": "20"
    },
    {
      "title": "Crime and Punishment by Fyodor Dostoyevsky",
      "description": "It is a murder story, told from a murder;s point of view, that implicates even the most innocent reader in its enormities. It is a cat-and-mouse game between a tormented young killer and a cheerful.",
      "category": "1",
      "subcategory": "20"
    },
    {
      "title": " Alice's Adventures in Wonderland by Lewis Carroll",
      "description": "In 1862 Charles Lutwidge Dodgson, a shy Oxford mathematician with a stammer, created a story about a little girl tumbling down a rabbit hole. Thus began the immortal adventures of Alice, perhaps.",
      "category": "1",
      "subcategory": "20"
    },
    {
      "title": "Pride and Prejudice by Jane Austen",
      "description": "The book is narrated in free indirect speech following the main character Elizabeth Bennet as she deals with matters of upbringing, marriage, moral rightness and education in her aristocratic socie.",
      "category": "1",
      "subcategory": "20"
    },
    {
      "title": "To the Lighthouse by Virginia Woolf",
      "description": "A landmark novel of high modernism, the text, centering on the Ramsay family and their visits to the Isle of Skye in Scotland between 1910 and 1920, skillfully manipulates temporality and psycholog.",
      "category": "1",
      "subcategory": "20"
    },
    {
      "title": "Heart of Darkness by Joseph Conrad",
      "description": "The story details an incident when Marlow, an Englishman, took a foreign assignment from a Belgian trading company as a ferry-boat captain in Africa. Although Conrad does not specify the name.",
      "category": "1",
      "subcategory": "20"
    },
    {
      "title": "Anna Karenina by Leo Tolstoy",
      "description": "Anna Karenina tells of the doomed love affair between the sensuous and rebellious Anna and the dashing officer, Count Vronsky. Tragedy unfolds as Anna rejects her passionless marriage and must end.",
      "category": "1",
      "subcategory": "20"
    },
    {
      "title": "Nineteen Eighty Four by George Orwell",
      "description": "Like other books in this series, You Don’t Know JS: Async & Performance dives into trickier parts of the language that many JavaScript programmers simply avoid. Armed with this knowledge. Like other books in this series, You Don’t Know JS: Async & Performance dives into trickier parts of the language that many JavaScript programmers simply avoid. Armed with this knowledge.",
      "category": "1",
      "subcategory": "20"
    },
    {
      "title": "Great Expectations by Charles Dickens",
      "description": "Great Expectations is written in the genre of bildungsroman or the style of book that follows the story of a man or woman in their quest for maturity, usually starting from childhood and ending.",
      "category": "1",
      "subcategory": "20"
    },
    {
      "title": " One Thousand and One Nights by India",
      "description": "One Thousand and One Nights is a collection of Middle Eastern and South Asian stories and folk tales compiled in Arabic during the Islamic Golden Age. It is often known in English as the Arabian Nicea.",
      "category": "1",
      "subcategory": "20"
    }
  ]
}